"use strict";
// Завдання 1
let message1 = "Hello";
let message2 = "JavaScript";

alert(message1 + " " + message2 + "!");
//

// Завдання 2
let message; // Визначити message як змінну
message = "hello"; // Слід додати лапки для того щоб написане було рядком для того щоб написане було рядком
message = 123456;
//

// Завдання 3
let x = prompt("Введіть значення для x:");
let y = prompt("Введіть значення для y:");
let sum = parseFloat(x) + parseFloat(y);
alert("Сума x і y дорівнює: " + sum);
//

// Завдання 4
let a = 9007199254740991n; // Додав "n"
let b = 9007199254740991n;
console.log(a + b);
//

// Завдання 5
let apples = "2";
let oranges = "3";

alert(parseInt(apples) + parseInt(oranges));
//Перетворюємо рядок у число
//

// Завдання 6
{
  let a = 1,
    b = 1;
  let c = ++a; // 2
  let d = b++; // 1
}
// Обмежив область видимості для того щоб не лаялося на повтор змінних
//

// Завдання 7
{
  let a = 2;
  let x = 1 + (a *= 2); // (a*=2) = 4 , x = 5
}
//

// Завдання 8
"" + 1 + 0; // 10 - Відбувається конкатенація рядка
"" - 1 + 0; // Відповідь -1
true + false; // Відповідь 1 - true = 1 , false  = 0
6 / "3"; // Відповідь 2
"2" * "3"; // Відповідь 6
4 + 5 + "px"; // Відповідь "9px"
"$" + 4 + 5; // Відповідь "$45"
"4" - 2; // Відповідь 2
"4px" - 2; // Відповідь NaN
"  -9  " + 5; // Відповідь "- 9 5"
"  -9  " - 5; // Відповідь -14
null + 1; // Відповідь 1
undefined + 1; // Відповідь Nan
NaN + 1; // Відповідь Nan
//

// Завдання 9
let n = 2;
n = n + 5; // n += 5
n = n * 2; // n *= 2
//

// Завдання 10
let n1 = "   123   ";
let n2 = "123z";
let n3 = true;
let n4 = false;

n1 = parseInt(n1.trim()); //За допомогою trim - прибираємо пробіли
n2 = parseInt(n2);
n3 = Number(n3);
n4 = +n4;

console.log(n1, n2, n3, n4);
// Перетворити змінні n1, n2, n3, n4 на числа
